In [1]:
import pandas as pd
import numpy as np

In [42]:
country_station_df = pd.read_csv('county-station.csv')

In [43]:
country_station_df = country_station_df.drop(columns=['Unnamed: 0'], axis=1)

In [44]:
country_station_df[country_station_df['County Name'] == 'Saint Louis County']

          County Name Station
0  Saint Louis County   72745
1  Saint Louis County   KDYT0

In [48]:
def get_stations(county):
    a = country_station_df[country_station_df['County Name'] == county]
    return a['Station'].to_list()

In [49]:
get_stations('Saint Louis County')

['72745', 'KDYT0']

In [51]:
county_names = list(set(country_station_df['County Name'].to_list()))

In [53]:
len(county_names)

87

In [ ]:
for county in county_names:
    stations = get_stations(county)
    for station in stations:
        # open csva and read data read data from csv

In [67]:
def open_and_read_data(station):
    station_df = pd.read_csv('data/weather/minnesota_daily/' + station + '.csv', names=['data', 'avg', 'min', 'max', 'prec'], header=None)
    print(station_df)

In [85]:
open_and_read_data('72745')

             data   avg   min   max  prec
0      1948-01-01   NaN -15.6  -3.3   0.0
1      1948-01-02  -4.1  -8.9  -2.2   0.0
2      1948-01-03  -8.5 -12.8  -5.6   0.0
3      1948-01-04  -6.5 -10.0  -1.7   0.0
4      1948-01-05  -2.9  -7.2   1.1   0.0
...           ...   ...   ...   ...   ...
27199  2022-06-20  23.2  17.5  28.4   NaN
27200  2022-06-21  22.2  17.5  26.7   NaN
27201  2022-06-22  20.3  15.0  25.1   NaN
27202  2022-06-23  19.5  14.4  24.8   NaN
27203  2022-06-24  19.0  13.8  23.9   NaN

[27204 rows x 5 columns]

In [89]:
station_df = pd.read_csv('data/weather/minnesota_daily/' + '72745' + '.csv', names=['data', 'avg', 'min', 'max','prec'], header=None)

In [90]:
station_df.isna().sum()

data       0
avg     2995
min        0
max        0
prec       7
dtype: int64

In [91]:
station_df = station_df.drop(columns=['prec'], axis=1)

In [92]:
station_df.columns

Index(['data', 'avg', 'min', 'max'], dtype='object')

In [93]:
station_df

             data   avg   min   max
0      1948-01-01   NaN -15.6  -3.3
1      1948-01-02  -4.1  -8.9  -2.2
2      1948-01-03  -8.5 -12.8  -5.6
3      1948-01-04  -6.5 -10.0  -1.7
4      1948-01-05  -2.9  -7.2   1.1
...           ...   ...   ...   ...
27199  2022-06-20  23.2  17.5  28.4
27200  2022-06-21  22.2  17.5  26.7
27201  2022-06-22  20.3  15.0  25.1
27202  2022-06-23  19.5  14.4  24.8
27203  2022-06-24  19.0  13.8  23.9

[27204 rows x 4 columns]

In [99]:
station_df['max'].isna().sum()

0